tutorials/incompressibleVoF/planingHullW3/system/topoSetDict.2
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  12
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    location    "system";
    object      topoSetDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

actions
(
    {
        name    c1;
        type    cellSet;
        action  new;
        source  boxToCell;
        box (-4.0 -3.0 -2) (4.0 0 3.0);
    }
    {
        name    c2;
        type    cellSet;
        action  new;
        source  boxToCell;
        box (-3.0 -2.0 -1.4) (3.5 0 1.7);
    }
    {
        name    c3;
        type    cellSet;
        action  new;
        source  boxToCell;
        box (-2.5 -0.8 -0.6) (3.0 0 1.1);
    }
    {
        name    c4;
        type    cellSet;
        action  new;
        source  boxToCell;
        box (-2.0 -0.6 -0.4) (2.5 0 0.7);
    }
);

// ************************************************************************* //
